TakeshiShiode/sample_cq_interface2023/qemu-6.0.0/hw/timer/rx62t_keytest.c
//***********************************************************************************
//! @name TIMCU_tick
//@{
//-----------------------------------------------------------------------------
//
static void KeyTest_tick(void *opaque)
{
    RKEYTESTState *s = RKEYTEST(opaque);
	uint8_t * pMatComMemory = GetMatBLDCComMemory();
	signed short* pKEYTEST_AD1_ADDR2 = (signed short*)(pMatComMemory + KEYTEST_AD1_ADDR2_OFFSET);
//	if(s->teststate == 0){
	    if(GetKeyState(VK_SHIFT) & 0x8000){
			if(GetKeyState('A') & 0x8000) s->teststate = 1, s->testkey = 'A', printf("Key = %d\n",s->testkey);
			if(GetKeyState('B') & 0x8000) s->teststate = 1, s->testkey = 'B', printf("Key = %d\n",s->testkey);
			if(GetKeyState('C') & 0x8000) s->teststate = 1, s->testkey = 'C', printf("Key = %d\n",s->testkey);
			if(GetKeyState('D') & 0x8000) s->teststate = 1, s->testkey = 'D', printf("Key = %d\n",s->testkey);
			if(GetKeyState('E') & 0x8000) s->teststate = 1, s->testkey = 'E', printf("Key = %d\n",s->testkey);
			if(GetKeyState('F') & 0x8000) s->teststate = 1, s->testkey = 'F', printf("Key = %d\n",s->testkey);
			if(GetKeyState('G') & 0x8000) s->teststate = 1, s->testkey = 'G', printf("Key = %d\n",s->testkey);
			if(GetKeyState('H') & 0x8000) s->teststate = 1, s->testkey = 'H', printf("Key = %d\n",s->testkey);
			if(GetKeyState('I') & 0x8000) s->teststate = 1, s->testkey = 'I', printf("Key = %d\n",s->testkey);
			if(GetKeyState('J') & 0x8000) s->teststate = 1, s->testkey = 'J', printf("Key = %d\n",s->testkey);
			if(GetKeyState('K') & 0x8000) s->teststate = 1, s->testkey = 'K', printf("Key = %d\n",s->testkey);
			if(GetKeyState('L') & 0x8000) s->teststate = 1, s->testkey = 'L', printf("Key = %d\n",s->testkey);
			if(GetKeyState('M') & 0x8000) s->teststate = 1, s->testkey = 'M', printf("Key = %d\n",s->testkey);
			if(GetKeyState('N') & 0x8000) s->teststate = 1, s->testkey = 'N', printf("Key = %d\n",s->testkey);
			if(GetKeyState('O') & 0x8000) s->teststate = 1, s->testkey = 'O', printf("Key = %d\n",s->testkey);
			if(GetKeyState('P') & 0x8000) s->teststate = 1, s->testkey = 'P', printf("Key = %d\n",s->testkey);
			if(GetKeyState('Q') & 0x8000) s->teststate = 1, s->testkey = 'Q', printf("Key = %d\n",s->testkey);
			if(GetKeyState('R') & 0x8000) s->teststate = 1, s->testkey = 'R', printf("Key = %d\n",s->testkey);
			if(GetKeyState('S') & 0x8000) s->teststate = 1, s->testkey = 'S', printf("Key = %d\n",s->testkey);
			if(GetKeyState('T') & 0x8000) s->teststate = 1, s->testkey = 'T', printf("Key = %d\n",s->testkey);
			if(GetKeyState('U') & 0x8000) s->teststate = 1, s->testkey = 'U', printf("Key = %d\n",s->testkey);
			if(GetKeyState('V') & 0x8000) s->teststate = 1, s->testkey = 'V', printf("Key = %d\n",s->testkey);
			if(GetKeyState('W') & 0x8000) s->teststate = 1, s->testkey = 'W', printf("Key = %d\n",s->testkey);
			if(GetKeyState('X') & 0x8000) s->teststate = 1, s->testkey = 'X', printf("Key = %d\n",s->testkey);
			if(GetKeyState('Y') & 0x8000) s->teststate = 1, s->testkey = 'Y', printf("Key = %d\n",s->testkey);
			if(GetKeyState('Z') & 0x8000) s->teststate = 1, s->testkey = 'Z', printf("Key = %d\n",s->testkey);
		}
		else{
			if(GetKeyState('A') & 0x8000) s->teststate = 1, s->testkey = 'A' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('B') & 0x8000) s->teststate = 1, s->testkey = 'B' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('C') & 0x8000) s->teststate = 1, s->testkey = 'C' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('D') & 0x8000) s->teststate = 1, s->testkey = 'D' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('E') & 0x8000) s->teststate = 1, s->testkey = 'E' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('F') & 0x8000) s->teststate = 1, s->testkey = 'F' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('G') & 0x8000) s->teststate = 1, s->testkey = 'G' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('H') & 0x8000) s->teststate = 1, s->testkey = 'H' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('I') & 0x8000) s->teststate = 1, s->testkey = 'I' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('J') & 0x8000) s->teststate = 1, s->testkey = 'J' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('K') & 0x8000) s->teststate = 1, s->testkey = 'K' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('L') & 0x8000) s->teststate = 1, s->testkey = 'L' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('M') & 0x8000) s->teststate = 1, s->testkey = 'M' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('N') & 0x8000) s->teststate = 1, s->testkey = 'N' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('O') & 0x8000) s->teststate = 1, s->testkey = 'O' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('P') & 0x8000) s->teststate = 1, s->testkey = 'P' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('Q') & 0x8000) s->teststate = 1, s->testkey = 'Q' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('R') & 0x8000){
				RIOPORTState *ioport;
				s->teststate = 1, s->testkey = 'R' + 32, printf("Key = %d\n",s->testkey);
				ioport = Get_RIOPORTState();
				if( (ioport->port9.port & 0x04) != 0 ){
					ioport->port9.port &= 0xFB;
					printf("bldc_reset_on\n");
				}
				else{
					ioport->port9.port |= 0x04;
					printf("bldc_reset_off\n");
				}
				 printf("port9=%d\n",ioport->port9.port);
			}
			if(GetKeyState('S') & 0x8000){
				RIOPORTState *ioport;
				s->teststate = 1, s->testkey = 'S' + 32, printf("Key = %d\n",s->testkey);
				ioport = Get_RIOPORTState();
				if( (ioport->port9.port & 0x02) != 0 ){
					ioport->port9.port &= 0xFD;
					printf("bldc_sw1_on\n");
				}
				else{
					ioport->port9.port |= 0x02;
					printf("bldc_sw1_off\n");
				}
			}
			if(GetKeyState('T') & 0x8000) s->teststate = 1, s->testkey = 'T' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('U') & 0x8000) s->teststate = 1, s->testkey = 'U' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('V') & 0x8000) s->teststate = 1, s->testkey = 'V' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('W') & 0x8000) s->teststate = 1, s->testkey = 'W' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('X') & 0x8000) s->teststate = 1, s->testkey = 'X' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('Y') & 0x8000) s->teststate = 1, s->testkey = 'Y' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('Z') & 0x8000) s->teststate = 1, s->testkey = 'Z' + 32, printf("Key = %d\n",s->testkey);
			if(GetKeyState('1') & 0x8000) s->teststate = 1, s->testkey = '1', printf("Key = %d\n",s->testkey);
			if(GetKeyState('2') & 0x8000) s->teststate = 1, s->testkey = '2', printf("Key = %d\n",s->testkey);
			if(GetKeyState('3') & 0x8000) s->teststate = 1, s->testkey = '3', printf("Key = %d\n",s->testkey);
			if(GetKeyState('4') & 0x8000) s->teststate = 1, s->testkey = '4', printf("Key = %d\n",s->testkey);
			if(GetKeyState('5') & 0x8000) s->teststate = 1, s->testkey = '5', printf("Key = %d\n",s->testkey);
			if(GetKeyState('6') & 0x8000) s->teststate = 1, s->testkey = '6', printf("Key = %d\n",s->testkey);
			if(GetKeyState('7') & 0x8000) s->teststate = 1, s->testkey = '7', printf("Key = %d\n",s->testkey);
			if(GetKeyState('8') & 0x8000) s->teststate = 1, s->testkey = '8', printf("Key = %d\n",s->testkey);
			if(GetKeyState('9') & 0x8000) s->teststate = 1, s->testkey = '9', printf("Key = %d\n",s->testkey);
			if(GetKeyState('0') & 0x8000) s->teststate = 1, s->testkey = '0', printf("Key = %d\n",s->testkey);
			if(GetKeyState(VK_UP) & 0x8000){
				*pKEYTEST_AD1_ADDR2 = *pKEYTEST_AD1_ADDR2 + 40;
				if(*pKEYTEST_AD1_ADDR2 > 0x0FFF){
					*pKEYTEST_AD1_ADDR2 = 0x0FFF;
				}
				//printf("spd = %d\n", *pKEYTEST_AD1_ADDR2);
			}
			if(GetKeyState(VK_DOWN) & 0x8000){
				*pKEYTEST_AD1_ADDR2 = *pKEYTEST_AD1_ADDR2 - 40;
				if(*pKEYTEST_AD1_ADDR2 < 0x0000){
					*pKEYTEST_AD1_ADDR2 = 0x0000;
				}
				//printf("spd = %d\n", *pKEYTEST_AD1_ADDR2);
				
