TakeshiShiode/sample_cq_interface2023/qemu-6.0.0/hw/timer/rx62t_keytest.c
			}
		}
//	}
	
    timer_mod(&s->timer, qemu_clock_get_ms(QEMU_CLOCK_VIRTUAL) + 200);
}




//***********************************************************************************
//! @name QEMU region
//@{
static const MemoryRegionOps rx62t_keytest_mem_ops = {
    .read = KeyTestRead,
    .write = KeyTestWrite,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

//-----------------------------------------------------------------------------

//! Instance initializer.
static void Rx62t_KeyTest_init(Object *obj) {
    DeviceState *dev = DEVICE(obj);
    SysBusDevice *sd = SYS_BUS_DEVICE(obj);
    RKEYTESTState *s = RKEYTEST(obj);
	uint32_t i;
	
	uint8_t * pMatComMemory = GetMatBLDCComMemory();
	signed short* pKEYTEST_AD1_ADDR2 = (signed short*)(pMatComMemory + KEYTEST_AD1_ADDR2_OFFSET);
	*pKEYTEST_AD1_ADDR2 = 0;
	
    memory_region_init_io(&s->mmio, OBJECT(dev), &rx62t_keytest_mem_ops, s,
                          "rx62t_keytest", (uint64_t)TESTKEY_SIZE);
    sysbus_init_mmio(sd, &s->mmio);
	
	for(i=0; i<256; i++){
		s->sentence[i] = (uint8_t)'\0';
	}
    
   	timer_init_ms(&s->timer, QEMU_CLOCK_VIRTUAL, KeyTest_tick, s);
   	timer_mod(&s->timer, qemu_clock_get_ms(QEMU_CLOCK_VIRTUAL) + 100);
    return;
}

static Property Rx62t_KeyTest_propaties[] =  {
    DEFINE_PROP_END_OF_LIST(),
};


//-----------------------------------------------------------------------------
//! Class initializer.
static void Rx62t_KeyTest_class_init(ObjectClass * klass, void *data) {
    DeviceClass *dc = DEVICE_CLASS(klass);
    
    device_class_set_props(dc, Rx62t_KeyTest_propaties);
}


static TypeInfo Rx62t_KeyTest_info = {
    .name = TYPE_RENESAS_KEYTEST,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(RKEYTESTState),
    .instance_init = Rx62t_KeyTest_init,
    .class_init = Rx62t_KeyTest_class_init,
};

static void Rx62t_KeyTest_register_device(void) {
    type_register_static(&Rx62t_KeyTest_info);
}

type_init(Rx62t_KeyTest_register_device)
//@}
